Fese673/ZEGAR-ESP32/src/main.cpp
#include <Arduino.h>
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <WiFi.h>
#include <time.h>
#include <Esp.h>

#include "STM32_Data.h"
#include "LCDMirror.h"
#include "UI_Controller.h"
#include "Encoder.h"
#include "AppState.h"
#include "UI_Draw.h"
#include "WiFiSync.h"
#include "RTCService.h"

#include <sys/time.h>
#include "MQTTSync.h"
#include "StatsManager.h" 
#include "AudioBT.h" 
#include "ModeManager.h"
#include "RadioModeSwitch.h"
#include "PMS_Czujnik.h"
#include "ENS160AHT21Screen.h"
#include "ENS160AHT21Sensor.h"
#include "BMP280Sensor.h"
#include "LCDIcons.h"
#include <DHT.h>
#include "TemperatureConfig.h"
#include "I2C_bus_shared.h"

// ============================================================================
// STAŁE CZASOWE (zamiast magic numbers)
// ============================================================================
constexpr unsigned long CLOCK_TICK_MS       = 1000; // tykanie zegara co 1s
constexpr unsigned long MELODY_STEP_MS      = 300;  // krok melodii alarmu
constexpr unsigned long ALARM_DURATION_MS   = 5000; // jak długo gra alarm
constexpr unsigned long STM32_UPDATE_MS     = 500;  // odświeżanie danych STM32
constexpr unsigned long STM32_TIMEOUT_MS    = 3000; // timeout połączenia STM32
constexpr unsigned long STOPER_DRAW_MS      = 100;  // odświeżanie stopera
constexpr unsigned long WIFI_RETRY_DELAY_MS = 500;  // próba połączenia WiFi
constexpr int           WIFI_MAX_RETRIES    = 20;   // max prób połączenia
constexpr unsigned long MSG_DISPLAY_MS      = 1500; // wyświetlanie komunikatów

// ============================================================================
// HOME LCD refresh policy
// ============================================================================
// Wymóg: ekran HOME (LCD + UART mirror) ma odświeżać się maks. 1x/s.
// Zamiast wołać drawHome() bezpośrednio z wielu miejsc, używamy bramki:
// - requestHomeRedraw(): zaznacza, że HOME wymaga odświeżenia
// - serviceHomeRedraw(): wykonuje drawHome() nie częściej niż co 1000ms
static bool          s_homeRedrawDirty      = true;
static unsigned long s_lastHomeRedrawMs    = 0;
static constexpr unsigned long HOME_REDRAW_MIN_INTERVAL_MS = 1000;

enum class HomeUiProfile : uint8_t {
  Minimal  = 0,
  Balanced = 1,
  Extreme  = 2,
};

enum class HomeOverlayPage : uint8_t {
  Time     = 0,
  Indoor   = 1,
  Outdoor  = 2,
  Extreme  = 3,
  Systems  = 4,
};

static HomeUiProfile   s_homeUiProfile       = HomeUiProfile::Minimal;
static HomeOverlayPage s_homeOverlay         = HomeOverlayPage::Time;
static uint8_t         s_homeOverlayIndex    = 0;
static unsigned long   s_homeOverlaySinceMs  = 0;
static unsigned long   s_homeIndoorAnimSinceMs = 0;
// Runtime-configurable overlay switch interval (ms). Persisted via Preferences as seconds.
unsigned long s_homeOverlaySwitchMs = 7000; // default 7s
int settingsRotationSec = 7;               // 1..10 seconds (user-facing)
int s_prevSettingsRotationSec = 7;         // used to restore on cancel
int s_prevSettingsUiScreenIndex = 0;        // used to restore UI screen selection on cancel

extern int settingsUiScreenIndex;

// Preferences namespace object (for persistent settings)
#include <Preferences.h>
Preferences s_prefs;

static void requestHomeRedraw();

static uint8_t homeOverlayCountForProfile(HomeUiProfile profile) {
  switch (profile) {
    case HomeUiProfile::Minimal:
      return 2;
    case HomeUiProfile::Balanced:
      return 3;
    case HomeUiProfile::Extreme:
      return 5;
  }
  return 2;
}

static HomeOverlayPage homeOverlayPageFor(HomeUiProfile profile, uint8_t index) {
  switch (profile) {
    case HomeUiProfile::Minimal:
      return (index % 2 == 0) ? HomeOverlayPage::Time : HomeOverlayPage::Outdoor;
    case HomeUiProfile::Balanced:
      switch (index % 3) {
        case 0: return HomeOverlayPage::Time;
        case 1: return HomeOverlayPage::Indoor;
        default: return HomeOverlayPage::Outdoor;
      }
    case HomeUiProfile::Extreme:
      switch (index % 5) {
        case 0: return HomeOverlayPage::Time;
        case 1: return HomeOverlayPage::Indoor;
        case 2: return HomeOverlayPage::Outdoor;
        case 3: return HomeOverlayPage::Extreme;
        default: return HomeOverlayPage::Systems;
      }
  }
  return HomeOverlayPage::Time;
}

static void syncHomeOverlayToProfile(bool resetTimer) {
  const uint8_t overlayCount = homeOverlayCountForProfile(s_homeUiProfile);
  if (overlayCount == 0) {
    s_homeOverlayIndex = 0;
    s_homeOverlay = HomeOverlayPage::Time;
    s_homeOverlaySinceMs = 0;
    s_homeIndoorAnimSinceMs = 0;
    requestHomeRedraw();
    return;
  }

  if (s_homeOverlayIndex >= overlayCount) {
    s_homeOverlayIndex = 0;
  }

  s_homeOverlay = homeOverlayPageFor(s_homeUiProfile, s_homeOverlayIndex);
  if (resetTimer) {
    s_homeOverlaySinceMs = millis();
    s_homeIndoorAnimSinceMs = s_homeOverlay == HomeOverlayPage::Indoor ? s_homeOverlaySinceMs : 0;
  }
  requestHomeRedraw();
}

static void requestHomeRedraw() {
  s_homeRedrawDirty = true;
}

static void serviceHomeRedraw() {
  if (appState != STATE_HOME) return;
  if (!s_homeRedrawDirty) return;

  const unsigned long nowMs = millis();
  if (s_lastHomeRedrawMs != 0 && (nowMs - s_lastHomeRedrawMs) < HOME_REDRAW_MIN_INTERVAL_MS) {
    return;
  }

  s_lastHomeRedrawMs = nowMs;
  s_homeRedrawDirty  = false;

  // Jedyna ścieżka, która fizycznie rysuje na LCD (+ mirror UART).
  switch (s_homeOverlay) {
    case HomeOverlayPage::Indoor:
      drawIndoorWeatherScreen();
      break;
    case HomeOverlayPage::Outdoor:
      drawAirScreen();
      break;
    case HomeOverlayPage::Extreme:
      drawExtremeEnvironmentScreen();
      break;
    case HomeOverlayPage::Systems:
      drawSystemResources();
      break;
    case HomeOverlayPage::Time:
    default:
      drawHome();
      break;
  }
}

void setHomeUiProfile(uint8_t profileIndex) {
  if (profileIndex > static_cast<uint8_t>(HomeUiProfile::Extreme)) {
    profileIndex = 0;
  }

  s_homeUiProfile = static_cast<HomeUiProfile>(profileIndex);
  settingsUiScreenIndex = (int)profileIndex;
  syncHomeOverlayToProfile(true);
}

// Zamiast bezpośredniego drawHome() w kodzie aplikacji wywołuj to.
static void drawHomeThrottled() {
  requestHomeRedraw();
  serviceHomeRedraw();
}

static void serviceHomeOverlayRotation() {
  if (appState != STATE_HOME) return;

  const unsigned long nowMs = millis();
  const uint8_t overlayCount = homeOverlayCountForProfile(s_homeUiProfile);

  if (overlayCount == 0) {
    return;
  }

