Fese673/ZEGAR-ESP32/src/main.cpp
  if (s_homeOverlaySinceMs == 0) {
    s_homeOverlayIndex = 0;
    s_homeOverlay = homeOverlayPageFor(s_homeUiProfile, s_homeOverlayIndex);
    s_homeOverlaySinceMs = nowMs;
    requestHomeRedraw();
    return;
  }

  if (nowMs - s_homeOverlaySinceMs >= s_homeOverlaySwitchMs) {
    s_homeOverlaySinceMs = nowMs;
    s_homeOverlayIndex = (uint8_t)((s_homeOverlayIndex + 1) % overlayCount);
    s_homeOverlay = homeOverlayPageFor(s_homeUiProfile, s_homeOverlayIndex);
    s_homeIndoorAnimSinceMs = s_homeOverlay == HomeOverlayPage::Indoor ? nowMs : 0;
    requestHomeRedraw();
    return;
  }

  if (s_homeOverlay == HomeOverlayPage::Indoor) {
    constexpr unsigned long HOME_INDOOR_ANIM_MS = 3500UL;
    if (s_homeIndoorAnimSinceMs == 0) {
      s_homeIndoorAnimSinceMs = nowMs;
    } else if ((nowMs - s_homeIndoorAnimSinceMs) >= HOME_INDOOR_ANIM_MS) {
      s_homeIndoorAnimSinceMs = nowMs;
      requestHomeRedraw();
    }
  }
}

static void handleHomeEntryIfStateChanged() {
  static AppState lastState = STATE_HOME;
  if (appState == lastState) return;

  // We just entered HOME: start from TIME view for 3 seconds.
  if (appState == STATE_HOME) {
    s_homeOverlayIndex = 0;
    syncHomeOverlayToProfile(true);
  }

  lastState = appState;
}
constexpr unsigned long SETUP_DELAY_MS      = 100;  // min delay for serial init

// ============================================================================
// DEKLARACJE FUNKCJI (dla PlatformIO)
// ============================================================================


// --- Logika zegara ---
void tickClock();
void playAlarmMelody();

// --- Wrapper dla kompatybilności ---
void syncTimeFromWiFi() {
  // Uruchom sync w trybie Wi-Fi, wymuszając wyłączenie BT.
  ModeManager::wifiOn();
}

// --- zasoby systemu ---
void drawSystemResources();

// ============================================================================
// KONFIGURACJA SPRZĘTU (PINY + STAŁE)
// ============================================================================

// --- 7-SEG (74HC595) - piny zdefiniowane w UI_Draw.h jako makra ---
// DATA_PIN = 23, CLOCK_PIN = 18, LATCH_PIN = 5

// --- Buzzer ---
constexpr uint8_t BUZZER_PIN = 19;
const int melodyFreq[] = {1000, 1400, 1000, 1600};
constexpr int MELODY_LEN = 4;

// --- Encoder (piny dla encoder_begin) ---
constexpr uint8_t ENC_CLK = 25;
constexpr uint8_t ENC_DT  = 26;
constexpr uint8_t ENC_SW  = 27;

// --- UART / Komunikacja ---
constexpr long UART_BAUD = 115200;
HardwareSerial& uart = Serial2;

// --- WiFi / NTP ---
const char* const WIFI_SSID  = "Orange_Swiatlowod_98E2";
const char* const WIFI_PASS  = "x1Z6P(~8pry<St.";
const char* const NTP_SERVER = "pool.ntp.org";

// --- DHT Sensor ---
// --- DHT11 ---
#define DHT_PIN 4
#define DHT_TYPE DHT11

// --- DHT11 ---
void updateDHT();
void drawTemperature();
void drawHumidity();
void showTemperature7Seg();
void showHumidity7Seg();


// ============================================================================
// ZMIENNE GLOBALNE (pogrupowane funkcjonalnie)
// ============================================================================

// --- AppState (EXTERN z AppState.cpp) ---
// extern AppState appState;   (zdefiniowane w AppState.cpp)
// extern EditState editState; (zdefiniowane w AppState.cpp)

// --- Menu Główne ---
int menuIndex = 0;
const char* menuItems[] = {
  "Ustaw czas",
  "Minutnik",
  "Stoper",
  "Budzik",
  "Statystyki",
  "Debug STM32",
  "PMS5003",
  "AHT21 + ENS160",
  "BMP280",
  "Temperatura",
  "Wilgotnosc",
  "Ustawienia",
  "Wyjscie",
  "Radio: Toggle"
};
constexpr int MENU_COUNT = 14;
int menuCount = MENU_COUNT;

// Diagnostyka pamięci
static uint32_t heapBaseline = 0;

// --- Menu Statystyk ---
int statsMenuIndex = 0;
const char* statsMenuItems[] = {
  "Kliki",
  "Kroki",
  "Temp min/max",
  "Wilg min/max",
  "Zasoby",
  "Wyjscie"
};
constexpr int STATS_MENU_COUNT = 6;
int statsMenuCount = STATS_MENU_COUNT;

// --- Menu Zasobów Systemu ---
int resourcesMenuIndex = 0;
const char* resourcesMenuItems[] = {
  "RAM Free",
  "CPU",
  "Flash Free"
};
constexpr int RESOURCES_MENU_COUNT = 3;
int resourcesMenuCount = RESOURCES_MENU_COUNT;

// --- Menu PMS5003 ---
int pms5003MenuIndex = 0;
const char* pms5003MenuItems[] = {
  "Tryb Fabryczny",
  "Tryb Atmosferyczny",
  "L.Czastek #/100cm3",
  "Telemetria",
  "Wyjscie"
};
constexpr int PMS5003_MENU_COUNT = 5;
int pms5003MenuCount = PMS5003_MENU_COUNT;

// --- Menu ENS160 + AHT21 ---
int ens160MenuIndex = 0;
const char* ens160MenuItems[] = {
  "AQI",
  "TVOC",
  "eCO2",
  "Temperature",
  "Humidity",
  "Status"
};
constexpr int ENS160_MENU_COUNT = 6;
int ens160MenuCount = ENS160_MENU_COUNT;

// --- Menu BMP280 ---
int bmp280MenuIndex = 0;
const char* bmp280MenuItems[] = {
  "Temperature",
  "Pressure",
  "Status",
  "Altitude"
};
constexpr int BMP280_MENU_COUNT = 4;
int bmp280MenuCount = BMP280_MENU_COUNT;

// --- Menu PMS5003 CF=1 (Wybór PM do szczegółów) ---
int pms5003CF1MenuIndex = 0;
const char* pms5003CF1MenuItems[] = {
  "PM1.0",
  "PM2.5",
  "PM10"
};
constexpr int PMS5003_CF1_MENU_COUNT = 3;
int pms5003CF1MenuCount = PMS5003_CF1_MENU_COUNT;

// --- Menu PMS5003 ATM (Wybór PM do szczegółów) ---
int pms5003ATMMenuIndex = 0;
const char* pms5003ATMMenuItems[] = {
  "PM1.0",
  "PM2.5",
  "PM10"
};
constexpr int PMS5003_ATM_MENU_COUNT = 3;
int pms5003ATMMenuCount = PMS5003_ATM_MENU_COUNT;

// --- Menu PMS5003 PARTICLE COUNT (Wybór rozmiaru cząstki) ---
int pms5003ParticlesMenuIndex = 0;
const char* pms5003ParticlesMenuItems[] = {
  "0.3um",
  "0.5um",
  "1.0um",
  "2.5um",
  "5.0um",
  "10um"
};
constexpr int PMS5003_PARTICLES_MENU_COUNT = 6;
int pms5003ParticlesMenuCount = PMS5003_PARTICLES_MENU_COUNT;

// --- Menu Ustawień (Settings) ---
int settingsMenuIndex = 0;
const char* settingsMenuItems[] = {
  "PMS5003",
  "Buzzer",
  "MQTT",
  "Synchronizacja",
  "Rotacja Ekranu",
  "UI EKRAN",
  "Wyjscie"
};
constexpr int SETTINGS_MENU_COUNT = 7;
int settingsMenuCount = SETTINGS_MENU_COUNT;

// --- Menu: Synchronizacja (NTP) ---
int settingsSyncMinutes = 60; // default 60 minutes
int s_prevSettingsSyncMin = 60;

