Fese673/ZEGAR-ESP32/src/main.cpp
// --- Menu Ustawienia UI EKRAN ---
int settingsUiScreenIndex = 0;
const char* settingsUiScreenItems[] = {
  "Minimal",
  "Balanced",
  "Extreme"
};
constexpr int SETTINGS_UI_SCREEN_COUNT = 3;
int settingsUiScreenCount = SETTINGS_UI_SCREEN_COUNT;

// --- Menu Ustawienia PMS5003 (włącz/wyłącz) ---
int settingsPmsMenuIndex = 0;
const char* settingsPmsMenuItems[] = {
  "Wlaczony",
  "Wylaczony"
};
constexpr int SETTINGS_PMS_MENU_COUNT = 2;
int settingsPmsMenuCount = SETTINGS_PMS_MENU_COUNT;

// --- Menu Ustawienia Buzera (włącz/wyłącz) ---
int settingsBuzzerMenuIndex = 0;
const char* settingsBuzzerMenuItems[] = {
  "Wlaczony",
  "Wylaczony"
};
constexpr int SETTINGS_BUZZER_MENU_COUNT = 2;
int settingsBuzzerMenuCount = SETTINGS_BUZZER_MENU_COUNT;

// --- Menu Ustawienia MQTT (włącz/wyłącz) ---
int settingsMqttMenuIndex = 0;
const char* settingsMqttMenuItems[] = {
  "Wlaczony",
  "Wylaczony"
};
constexpr int SETTINGS_MQTT_MENU_COUNT = 2;
int settingsMqttMenuCount = SETTINGS_MQTT_MENU_COUNT;

// --- Dane PMS5003 TELEMETRIA ---
uint16_t pms5003_errorCount_current = 0;
uint16_t pms5003_errorCount_total = 0;
uint16_t pms5003_bytesReceived = 0;
uint32_t pms5003_lastFrameTime = 0;
uint32_t pms5003_latency_ms = 0;

// --- Dane PMS5003 BIEŻĄCE ---
uint16_t pms5003_PM1_0_CF1 = 0;
uint16_t pms5003_PM2_5_CF1 = 0;
uint16_t pms5003_PM10_CF1 = 0;

uint16_t pms5003_PM1_0_ATM = 0;
uint16_t pms5003_PM2_5_ATM = 0;
uint16_t pms5003_PM10_ATM = 0;

// --- Dane PMS5003 HISTORYCZNE (min/max) - TRYB CF=1 ---
uint16_t pms5003_PM1_0_CF1_MIN = 9999;  uint16_t pms5003_PM1_0_CF1_MAX = 0;
uint16_t pms5003_PM2_5_CF1_MIN = 9999;  uint16_t pms5003_PM2_5_CF1_MAX = 0;
uint16_t pms5003_PM10_CF1_MIN = 9999;   uint16_t pms5003_PM10_CF1_MAX = 0;

// --- Dane PMS5003 HISTORYCZNE (min/max) - TRYB ATMOSFERYCZNY ---
uint16_t pms5003_PM1_0_ATM_MIN = 9999;  uint16_t pms5003_PM1_0_ATM_MAX = 0;
uint16_t pms5003_PM2_5_ATM_MIN = 9999;  uint16_t pms5003_PM2_5_ATM_MAX = 0;
uint16_t pms5003_PM10_ATM_MIN = 9999;   uint16_t pms5003_PM10_ATM_MAX = 0;

// --- Dane PMS5003 LICZBA CZĄSTEK (#/100cm³) - BIEŻĄCE ---
uint16_t pms5003_particleCount_0_3 = 0;
uint16_t pms5003_particleCount_0_5 = 0;
uint16_t pms5003_particleCount_1_0 = 0;
uint16_t pms5003_particleCount_2_5 = 0;
uint16_t pms5003_particleCount_5_0 = 0;
uint16_t pms5003_particleCount_10_0 = 0;

// --- Dane PMS5003 LICZBA CZĄSTEK (min/max) ---
uint16_t pms5003_particleCount_0_3_MIN = 9999;  uint16_t pms5003_particleCount_0_3_MAX = 0;
uint16_t pms5003_particleCount_0_5_MIN = 9999;  uint16_t pms5003_particleCount_0_5_MAX = 0;
uint16_t pms5003_particleCount_1_0_MIN = 9999;  uint16_t pms5003_particleCount_1_0_MAX = 0;
uint16_t pms5003_particleCount_2_5_MIN = 9999;  uint16_t pms5003_particleCount_2_5_MAX = 0;
uint16_t pms5003_particleCount_5_0_MIN = 9999;  uint16_t pms5003_particleCount_5_0_MAX = 0;
uint16_t pms5003_particleCount_10_0_MIN = 9999; uint16_t pms5003_particleCount_10_0_MAX = 0;

// --- CPU Load Tracking ---
uint8_t cpuLoadPercent = 0;
uint8_t cpuCore0Percent = 0;
uint8_t cpuCore1Percent = 0;
static unsigned long lastCpuReadTime = 0;

// --- System Resources Tracking ---
uint32_t ramFreeBytes = 0;
uint32_t flashFreeBytes = 0;

// --- Ustawienia (Configuration settings) ---
bool pms5003Enabled = true;   // Czy czujnik PMS5003 jest włączony
bool buzzerEnabled = true;    // Czy buzzer jest włączony

// --- Budzik ---
int  alarmHour       = 7;
int  alarmMinute     = 0;
bool alarmEnabled    = false;
bool alarmRinging    = false;
unsigned long alarmStartTime  = 0;

// --- Multi-alarm storage ---
const int MAX_ALARMS = 8;
AlarmEntry alarms[MAX_ALARMS];
int alarmsCount = 0; // number of configured alarms
int alarmsMenuIndex = 0; // selection in list view
int selectedAlarmIndex = 0; // index for editing/deleting
unsigned long lastMelodyStep  = 0;
int  melodyStep      = 0;
int alarmEditCursor = 0; // 0=CZAS,1=STATUS,2=USUN

// --- Minutnik (Timer) ---
int  timerSetMinutes  = 0;    // ustawiane przez użytkownika
int  timerSetSeconds  = 0;
bool timerRunning     = false;
unsigned long timerStartMillis = 0;
unsigned long timerDurationMs  = 0;

int  timerSetHours    = 0;
int  timerUiCursor    = 0; // 0=CZAS, 1=PRESETY
int  timerPresetIndex = 1; // default highlight: 15m

// --- STM32 DANE (UART) ---
unsigned long lastSTM32Update       = 0;
unsigned long lastSTM32DataReceived = 0;
int  displayedBPM    = 0;
int  displayedSPO2   = 0;
bool stm32Connected  = false;

// --- Stoper ---
bool stoperRunning         = false;
unsigned long stoperStart  = 0;
unsigned long stoperElapsed = 0;
unsigned long lastStoperDraw = 0;

// --- Czas (HH:MM:SS) ---
int hours   = 12;
int minutes = 0;
int seconds = 0;
unsigned long lastTick = 0;
bool bootDiagReprinted = false;

// --- Flaga do przywrócenia czasu z RTC (po soft reset) ---
static bool timeRestored = false;

// DS3231 persistence: write system time to RTC after successful NTP sync
static bool rtcWritePending = false;
static unsigned long lastRtcWriteAttemptMillis = 0;
static unsigned long rtcWriteNotBeforeMillis = 0;
static uint8_t rtcWriteFailureCount = 0;
static time_t rtcPendingEpoch = 0;
static unsigned long lastSeenNtpSyncMillis = 0;

static const char* TZ_POLAND = "CET-1CEST,M3.5.0,M10.5.0/3";

static bool isSystemTimeValid() {
  // 2021-01-01 00:00:00 UTC
  return time(nullptr) >= 1609459200;
}

static unsigned long rtcComputeBackoffMs(uint8_t failures) {
  // 0->0ms, 1->1s, 2->2s, 3->5s, 4->10s, 5->20s, >=6->60s
  if (failures == 0) return 0;
  if (failures == 1) return 1000;
  if (failures == 2) return 2000;
  if (failures == 3) return 5000;
  if (failures == 4) return 10000;
  if (failures == 5) return 20000;
  return 60000;
}

static void scheduleRtcWriteFromSystemTime() {
  if (!isSystemTimeValid()) return;
  rtcPendingEpoch = time(nullptr);
  rtcWritePending = true;
  rtcWriteFailureCount = 0;

  // Give the loop a moment after SNTP update (and reduce chance of I2C collisions)
  rtcWriteNotBeforeMillis = millis() + 2000UL;
}

static void syncLocalClockFromSystemTime() {
  time_t now = time(nullptr);
  struct tm ti;
  localtime_r(&now, &ti);
  hours = ti.tm_hour;
  minutes = ti.tm_min;
  seconds = ti.tm_sec;
}

static void tryRestoreSystemTimeFromDs3231() {
  RTCService::Config rtcCfg;
  rtcCfg.wire = &Wire;
  rtcCfg.sdaPin = 21;
  rtcCfg.sclPin = 22;
  rtcCfg.i2cClockHz = 400000;
  rtcCfg.i2cTimeoutMs = 10;
  rtcCfg.i2cRetries = 2;
  rtcCfg.initI2cMaster = false; // Wire.begin() already done in setup()
  rtcCfg.enableI2cDiagnostics = true;

  const RTCService::Status st = RTCService::begin(rtcCfg);
  Serial.printf("[RTC] begin: %s\n", RTCService::statusToString(st));
  if (st != RTCService::Status::Ok) {
    return;
  }

  time_t epoch = 0;
  const RTCService::Status rd = RTCService::getEpoch(&epoch);
  Serial.printf("[RTC] getEpoch: %s epoch=%ld\n", RTCService::statusToString(rd), (long)epoch);
  if (rd != RTCService::Status::Ok) {
    return;
  }

