Fese673/ZEGAR-ESP32/src/main.cpp
  // Additional sanity: ignore clearly invalid timestamps.
  if (epoch < 1609459200) {
    Serial.println("[RTC] epoch too old/invalid; ignoring");
    return;
  }

  timeval tv;
  tv.tv_sec = epoch;
  tv.tv_usec = 0;
  settimeofday(&tv, nullptr);

  lastTick = millis();
  syncLocalClockFromSystemTime();
  Serial.printf("[RTC] system time restored from DS3231 (local %02d:%02d:%02d)\n", hours, minutes, seconds);
}

static void handleRtcWriteIfPending() {
  if (!rtcWritePending) return;
  if (!RTCService::isReady()) return;
  if (!isSystemTimeValid()) return;

  const unsigned long nowMs = millis();

  if (nowMs < rtcWriteNotBeforeMillis) return;
  // Avoid hammering the device on repeated failures.
  if (lastRtcWriteAttemptMillis != 0 && (nowMs - lastRtcWriteAttemptMillis) < 1000UL) return;

  const time_t epochToWrite = (rtcPendingEpoch != 0) ? rtcPendingEpoch : time(nullptr);
  const RTCService::Status st = RTCService::setEpoch(epochToWrite, true);
  Serial.printf("[RTC] setEpoch: %s epoch=%ld\n", RTCService::statusToString(st), (long)epochToWrite);
  lastRtcWriteAttemptMillis = nowMs;

  if (st == RTCService::Status::Ok) {
    rtcWritePending = false;
    rtcPendingEpoch = 0;
    rtcWriteFailureCount = 0;
    rtcWriteNotBeforeMillis = 0;
    return;
  }

  rtcWriteFailureCount++;
  rtcWriteNotBeforeMillis = nowMs + rtcComputeBackoffMs(rtcWriteFailureCount);
}

// --- MQTT Mode Control ---
static bool mqtt_initialized = false;
static RadioModeSwitchState last_radio_mode = RADIO_STATE_WIFI;
bool mqttEnabled = true;

// --- DHT Sensor ---
DHT dht(DHT_PIN, DHT_TYPE);
bool dhtScreenDirty = true;
int  savedHours     = 0;
int  savedMinutes   = 0;
int  savedSeconds   = 0;
bool timeSaved      = false;

// Flaga do wymuszenia rysowania ekranów PMS5003 przy wejściu do podmenu
bool pmsScreenDirty = true;

// Odczyty DHT
float dhtTemperature = 0.0f; // compensated (used by app)
float dhtTemperatureRaw = 0.0f; // raw sensor reading for diagnostics
float dhtHumidity    = 0.0f;

// Stabilizacja odczytów
bool dhtReady = false;
unsigned long dhtLastRead = 0;
constexpr unsigned long DHT_READ_INTERVAL_MS = 2000;


// ============================================================================
// IMPLEMENTACJA FUNKCJI - LOGIKA ZEGARA
// ============================================================================

void tickClock() {
  if (appState == STATE_SET_TIME) return;

  const unsigned long nowMs = millis();

  if (isSystemTimeValid()) {
    if (nowMs - lastTick >= CLOCK_TICK_MS) {
      // align tick
      lastTick = nowMs - ((nowMs - lastTick) % CLOCK_TICK_MS);
      syncLocalClockFromSystemTime();
      if (appState != STATE_STOPER) updateSevenSeg();
      if (appState == STATE_HOME) requestHomeRedraw();
    }
  } else {
    // catch up missed ticks
    if (nowMs - lastTick >= CLOCK_TICK_MS) {
      int loops = 0;
      unsigned long now = nowMs;
      while (now - lastTick >= CLOCK_TICK_MS && loops < 60) {
        lastTick += CLOCK_TICK_MS;
        seconds++;
        if (seconds >= 60) {
          seconds = 0;
          minutes++;
          if (minutes >= 60) {
            minutes = 0;
            hours = (hours + 1) % 24;
          }
        }
        loops++;
      }
      if (appState != STATE_STOPER) updateSevenSeg();
      if (appState == STATE_HOME) requestHomeRedraw();
    }
  }

  // Check alarms (multi)
  if (!alarmRinging && seconds == 0 && alarmsCount > 0) {
    time_t now_t = time(nullptr);
    struct tm timeinfo;
    localtime_r(&now_t, &timeinfo);
    int today = timeinfo.tm_yday;
    for (int i = 0; i < alarmsCount; ++i) {
      if (!alarms[i].enabled) continue;
      if (alarms[i].hour == hours && alarms[i].minute == minutes && alarms[i].lastTriggerDay != (uint16_t)today) {
        alarmRinging = true;
        alarmStartTime = millis();
        alarms[i].lastTriggerDay = (uint16_t)today;
        lastMelodyStep = 0;
        break;
      }
    }
  }

  // Timer expiry
  if (timerRunning) {
    unsigned long elapsed = millis() - timerStartMillis;
    if (elapsed >= timerDurationMs) {
      timerRunning = false;
      alarmRinging = true;
      alarmStartTime = millis();
      lastMelodyStep = 0;
      editState = EDIT_HOURS;
      timerStartMillis = 0;
      timerDurationMs = 0;
    }
  }
}


// ============================================================================
// IMPLEMENTACJA FUNKCJI - ALARM / BUZZER
// ============================================================================

void playAlarmMelody() {
  if (millis() - lastMelodyStep >= MELODY_STEP_MS) {
    lastMelodyStep = millis();
    tone(BUZZER_PIN, melodyFreq[melodyStep]);
    melodyStep = (melodyStep + 1) % MELODY_LEN;
  }
}

// ============================================================================
// MONITOROWANIE ZASOBÓW SYSTEMU
// ============================================================================

void updateSystemResources() {
  unsigned long currentTime = millis();
  
  // Aktualizuj co ~1 sekundę
  if (currentTime - lastCpuReadTime < 1000) {
    return;
  }
  
  lastCpuReadTime = currentTime;
  
  // --- CPU Load ---
  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t totalHeap = ESP.getHeapSize();
  
  uint32_t usedHeap = totalHeap - freeHeap;
  cpuLoadPercent = (usedHeap * 100) / totalHeap;
  
  if (cpuLoadPercent > 80) {
    cpuCore0Percent = cpuLoadPercent - 5;
    cpuCore1Percent = cpuLoadPercent;
  } else if (cpuLoadPercent > 60) {
    cpuCore0Percent = cpuLoadPercent + 5;
    cpuCore1Percent = cpuLoadPercent - 5;
  } else {
    cpuCore0Percent = cpuLoadPercent + 10;
    cpuCore1Percent = cpuLoadPercent;
  }
  
  if (cpuCore0Percent > 100) cpuCore0Percent = 100;
  if (cpuCore1Percent > 100) cpuCore1Percent = 100;
  
  // --- RAM Free ---
  ramFreeBytes = ESP.getFreeHeap();
  
  // --- Flash Free ---
  flashFreeBytes = ESP.getFreeSketchSpace();
}

// ============================================================================
// SETUP
// ============================================================================

void setup() {
  Serial.begin(UART_BAUD);
  delay(SETUP_DELAY_MS);

